import Beregovo from "assets/images/Beregovo.jpg";
import Hust from "assets/images/Hust.jpg";
import Irshava from "assets/images/Irshava.jpg";
import Svaliava from "assets/images/Svaliava.jpg";
import Tyachiv from "assets/images/Tyachiv.jpg";
import VelykyBychkiv from "assets/images/VelykyBychkiv.jpg";
import Vinogradiv from "assets/images/Vinogradiv.jpg";

interface IData
{
	image: string;
	areas: string[];
}

export const data: Record<"Тячів" | "Виноградів" | "Берегове" | "Хуст" | "Свалява" | "Великий Бичків" | "Іршава", IData> =
{
	"Тячів":
	{
		image: Tyachiv,
		areas: (
			"Тячів, Округла, Нижня Апша, Підплеша, Вонігове, Терново, Ракове, Велика Уголька, Теребля, Біловарці, Вільхівці-Лази, Угля, Вишній Дубовець, Крива, Усть-Чорна, Вишоватий, Колодне, Грушово, Груники, Нересниця, Глиняний, Красна, Ганичі, Дулово, Лази, Кричево, Вільхівці, Новобарово, Топчино, Чумальово, Руня, Новоселиця, Глибокий Потік, Нижній, Дубовець, Німецька Мокра, Вільхівчик, Лопухів, Широкий Луг, Петрушів, Добрянське, Дубове, Тарасівка, Мала Уголька, Тисалово, Бедевля, Тячівка, Калини, Буштино, Солотвино, Тересва, Руське Поле, Руська Мокра".split(", ")
		)
	},
	"Виноградів":
	{
		image: Vinogradiv,
		areas: (
			"Виноградів, Боржавське, Ботар, Букове, Велика Копаня, Велика Паладь, Великі Ком'яти, Вербовець, Вилок, Карачинів, Королево, Мала Копаня, Неветленфолу, Нове Село, Олешник, Онок, Перехрестя, Пийтерфолво, Підвиноградів, Пушкіно, Руська Долина, Фертешолмаш, Чорний Потік, Шаланки, Широке, Чепа, Теково, Дюла, Чорнотисів, Сасово, Веряця, Черна, Матійово, Тисобикень, Тросник, Фанчиково, Хижа, Новоселиця, Гетиня, Оклі Гедь, Холмовець".split(", ")
		)
	},
	"Берегове":
	{
		image: Beregovo,
		areas: (
			"Берегове, Астей, Чома, Мочола, Дийда, Запсонь, Квасово, Великі Береги, Берегуйфалу, Оросієво, Мала Бийгань, Мужієво, Четфалва, Нижні Ремети, Яноші, Горонглаб, Бадалово, Шом, Гать, Косонь (Косино), Балажер, Геча, Верхні Ремети, Батрадь, Бене, Боржава, Велика Бакта, Вари, Кідьош".split(", ")
		)
	},
	"Хуст":
	{
		image: Hust,
		areas: (
			"Хуст, Яблунівка, Забрідь, Березово, Крива, Крайниково, Кошельово, Сокирниця, Копашново, Липецька Поляна, Іза, Забереж, Боронява, Данилово, Нижній Бистрий, Велятино, Шаян, Драгово, Липча, Вишково, Золотарьово, Олександрівка, Нанково, Рокосово, Стеблівка, Монастирець, Горінчово, Нижнє Селище, Кіреші, Ракош, Залом".split(", ")
		)
	},
	"Свалява":
	{
		image: Svaliava,
		areas: (
			"Свалява, Неліпино, Стройне, Мала Мартинка, Поляна, Пасіка, Лопушанка, Солочин, Березники, Росош, Драчино, Керецьки, Сасівка, Родниківка, Плав'я, Плоске, Голубине, Чорниця, Дусино, Тибава, Сусково, Яківське".split(", ")
		)
	},
	"Великий Бичків":
	{
		image: VelykyBychkiv,
		areas: (
			"Великий Бичків, Луг, Костилівка, Верхнє Водяне, Середнє Водяне, Водиця, Біла Церква, Косівська Поляна, Кобилецька Поляна, Росішка, Кваси, Ясіня, Лазещина, Чорна Тиса, Ділове, Paxiв, Богдан, Білин, Розточки, Видричка, Луги, Плаюць".split(", ")
		)
	},
	"Іршава":
	{
		image: Irshava,
		areas: (
			"Іршава, Ільниця, Сільце, Загаття, Заріччя, Великий Раковець, Білки, Приборжавське, Довге, Кушниця, Кам'янське, Хмільник, Дунковиця, Доробратово, Арданово, Малий Раковець, Імстичово, Луково, Бронька, Лисичово, Мідяниця, Дубрівка, Брід, Підгірне, Чорний Потік, Гребля, Вільхівка, Осій, Горбок, Заболотне, Нижнє Болотне".split(", ")
		)
	}
};

export type CitiesNameType = keyof typeof data;

export function getCityImage(city: CitiesNameType | null)
{
	if (city === null)
	{
		return "";
	}

	return data[ city ].image;
}
